{
  "brand.title": "SwapMyContact",
  "nav.start": "Start",
  "nav.privacy": "Datenschutzerklärung",
  "nav.imprint": "Impressum",
  "hero.title": "Willkommen bei SwapMyContact",
  "hero.text": "Dies ist die Startseite. Hier können Sie ein kurzes Einführungsvideo ansehen und mehr über unser Angebot erfahren.",
  "video.placeholder": "Videofenster (Platzhalter) – hier kommt dein Embed rein.",
  "privacy.title": "Datenschutzerklärung für die App SwapMyContact",
  "privacy.intro": "Stand: 28.11.2025",
  "privacy.controller": "1. Verantwortlicher",
  "privacy.controller.text": "Verantwortlicher im Sinne der DSGVO ist: Matthias Nowack, Sterntalerweg 13, 51469 Bergisch Gladbach, E-Mail: info@swapcontact.de",
  "privacy.data": "2. Welche Daten verarbeitet die App?",
  "privacy.data.text": "Die App verarbeitet ausschließlich Kontaktdaten, die Sie selbst eingeben, z. B.: Name, Telefonnummer, E-Mail-Adresse, Anschrift, Firma, Position/Funktion, Telefon, Mobiltelefon, Fax, Webseite, LinkedIn, XING, Twitter/X, Instagram, Facebook, WhatsApp Business. Die Verarbeitung erfolgt ausschließlich lokal auf Ihrem Endgerät. Die App benötigt keine Berechtigungen und erhebt keine Geräte- oder Nutzungsdaten.",
  "privacy.purpose": "3. Zweck und Rechtsgrundlage",
  "privacy.purpose.text": "Ihre lokal gespeicherten Kontaktdaten werden verarbeitet, um die Funktionen der App bereitzustellen (Speichern, Anzeigen, Bearbeiten und Erzeugen eines QR-Codes aus Ihren Eingaben). Rechtsgrundlage ist Art. 6 Abs. 1 lit. b DSGVO.",
  "privacy.transfer": "4. Keine Übermittlung / keine Empfänger",
  "privacy.transfer.text": "Es findet keine Übermittlung Ihrer Daten an uns oder an Dritte statt. Empfänger Ihrer Daten gibt es nicht. Ein Transfer in Drittländer findet nicht statt.",
  "privacy.retention": "5. Speicherdauer und Löschung",
  "privacy.retention.text": "Ihre Daten bleiben auf Ihrem Gerät gespeichert, bis Sie diese innerhalb der App löschen oder die App deinstallieren.",
  "privacy.qrcode": "6. Weitergabe über QR-Code",
  "privacy.qrcode.text": "Die App kann aus Ihren Eingaben einen QR-Code erzeugen. Nur wenn Sie einen QR-Code aktiv erstellen und einer anderen Person bereitstellen, geben Sie die darin enthaltenen Kontaktdaten weiter. Diese Weitergabe erfolgt ausschließlich durch Sie. Wir erhalten keine Kenntnis davon, ob, wann oder an wen Sie einen QR-Code weitergeben. Hinweis: Ein QR-Code kann personenbezogene Daten enthalten; die Weitergabe ist daher datenschutzrechtlich relevant und liegt in Ihrer Verantwortung.",
  "privacy.rights": "7. Ihre Rechte",
  "privacy.rights.text": "Sie haben die Rechte aus Art. 15–21 DSGVO (Auskunft, Berichtigung, Löschung, Einschränkung, Datenübertragbarkeit, Widerspruch). Da wir keine personenbezogenen Daten von Ihnen erhalten oder speichern, können Auskünfte nur zu den von uns nicht verarbeiteten Daten erteilt werden. Zur Löschung Ihrer Kontaktdaten nutzen Sie bitte die Löschfunktion der App. Sie haben zudem das Recht, sich bei einer Datenschutz-Aufsichtsbehörde zu beschweren. Zuständig ist z. B. die Behörde Ihres Wohnsitzes.",
  "privacy.obligation": "8. Pflicht zur Bereitstellung / Folgen",
  "privacy.obligation.text": "Die Eingabe von Kontaktdaten ist für die Nutzung der App-Funktionen erforderlich. Ohne Eingabe können diese Funktionen nicht genutzt werden.",
  "privacy.automated": "9. Automatisierte Entscheidungen",
  "privacy.automated.text": "Eine automatisierte Entscheidungsfindung einschließlich Profiling (Art. 22 DSGVO) findet nicht statt.",
  "privacy.local": "10. Lokale Speicherung (TDDDG)",
  "privacy.local.text": "Die App speichert Ihre Eingaben lokal auf Ihrem Endgerät und greift darauf zu, soweit dies zur Bereitstellung der App-Funktionen erforderlich ist. Diese Speicherung/Zugriffe sind technisch notwendig.",
  "imprint.title": "SwapMyContact",
  "imprint.intro": "Impressum",
  "imprint.responsible": "Anbieter",
  "imprint.responsible.text": "Matthias Nowack\nSterntalerweg 13\n51469 Bergisch Gladbach\nDeutschland\nE-Mail: info@swapcontact.de",
  "imprint.disclaimer": "Haftungsausschluss",
  "imprint.disclaimer.text": "Haftung für Inhalte und Links, Urheberrechtshinweise.",
  "footer.copyright": "Alle Rechte vorbehalten.",
  "footer.links.privacy": "Datenschutz",
  "footer.links.imprint": "Impressum",
  "footer.links.contact": "Kontakt"
}
