{
  "brand.title": "SwapMyContact",
  "nav.start": "Home",
  "nav.privacy": "Privacy Policy",
  "nav.imprint": "Imprint",
  "hero.title": "Welcome to SwapMyContact",
  "hero.text": "This is the homepage. Here you can watch a short introductory video and learn more about our offer.",
  "video.placeholder": "Video window (placeholder) – your embed goes here.",
  "privacy.title": "Privacy Policy for the SwapMyContact App",
  "privacy.intro": "As of: November 28, 2025",
  "privacy.controller": "1. Controller",
  "privacy.controller.text": "The controller within the meaning of the GDPR is: Matthias Nowack, Sterntalerweg 13, 51469 Bergisch Gladbach, E-Mail: info@swapcontact.de",
  "privacy.data": "2. What data does the app process?",
  "privacy.data.text": "The app processes only contact data that you enter yourself, e.g.: Name, phone number, email address, postal address, company, position/function, phone, mobile phone, fax, website, LinkedIn, XING, Twitter/X, Instagram, Facebook, WhatsApp Business. Processing takes place exclusively locally on your device. The app does not require any permissions and does not collect device or usage data.",
  "privacy.purpose": "3. Purpose and legal basis",
  "privacy.purpose.text": "Your locally stored contact data is processed to provide the app's functions (saving, displaying, editing and generating a QR code from your entries). The legal basis is Art. 6 para. 1 lit. b GDPR.",
  "privacy.transfer": "4. No transmission / no recipients",
  "privacy.transfer.text": "There is no transfer of your data to us or to third parties. There are no recipients of your data. No transfer to third countries takes place.",
  "privacy.retention": "5. Storage period and deletion",
  "privacy.retention.text": "Your data remains stored on your device until you delete it within the app or uninstall the app.",
  "privacy.qrcode": "6. Sharing via QR code",
  "privacy.qrcode.text": "The app can generate a QR code from your entries. Only if you actively create a QR code and provide it to another person do you share the contact data contained therein. This sharing is done exclusively by you. We do not receive any knowledge of whether, when or to whom you share a QR code. Note: A QR code may contain personal data; sharing is therefore relevant under data protection law and is your responsibility.",
  "privacy.rights": "7. Your rights",
  "privacy.rights.text": "You have the rights from Art. 15–21 GDPR (information, correction, deletion, restriction, data portability, objection). Since we do not receive or store any personal data from you, information can only be provided on the data we do not process. To delete your contact data, please use the app's deletion function. You also have the right to complain to a data protection supervisory authority. For example, the authority of your place of residence is responsible.",
  "privacy.obligation": "8. Obligation to provide / consequences",
  "privacy.obligation.text": "Entering contact data is required to use the app's functions. Without input, these functions cannot be used.",
  "privacy.automated": "9. Automated decisions",
  "privacy.automated.text": "Automated decision-making including profiling (Art. 22 GDPR) does not take place.",
  "privacy.local": "10. Local storage (TDDDG)",
  "privacy.local.text": "The app stores your entries locally on your device and accesses them insofar as this is necessary to provide the app's functions. This storage/access is technically necessary.",
  "imprint.title": "SwapMyContact",
  "imprint.intro": "Imprint",
  "imprint.responsible": "Provider",
  "imprint.responsible.text": "Matthias Nowack\nSterntalerweg 13\n51469 Bergisch Gladbach\nGermany\nE-mail: info@swapcontact.de",
  "imprint.vat": "VAT ID",
  "imprint.vat.text": "",
  "imprint.disclaimer": "Disclaimer",
  "imprint.disclaimer.text": "Liability for content and links, copyright notices.",
  "footer.copyright": "All rights reserved.",
  "footer.links.privacy": "Privacy",
  "footer.links.imprint": "Imprint",
  "footer.links.contact": "Contact"
}
